//------------------------------------------------------------------------------
//
//モジュールのボタン処理  [module_Button.cpp]
//Author:Yoshiki Hosoya
//
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
//インクルード
//------------------------------------------------------------------------------
#include "Bomb_Exterior.h"
#include "modelinfo.h"
#include "scene3D.h"
#include "sceneX.h"

//------------------------------------------------------------------------------
//静的メンバ変数の初期化
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
//マクロ
//------------------------------------------------------------------------------
#define EXTERIOR_OFFSET (D3DXVECTOR3(200.0f,100.0f,0.0f))
//#define EXTERIOR_OFFSET (D3DXVECTOR3(200.0f,100.0f,0.0f))
//------------------------------------------------------------------------------
//コンストラクタ
//------------------------------------------------------------------------------
CBomb_Exterior::CBomb_Exterior()
{
	m_pBatteryList.clear();
}

//------------------------------------------------------------------------------
//デストラクタ
//------------------------------------------------------------------------------
CBomb_Exterior::~CBomb_Exterior()
{
	m_pBatteryList.clear();
}

//------------------------------------------------------------------------------
//爆弾の外装生成
//------------------------------------------------------------------------------
U_ptr<CBomb_Exterior> CBomb_Exterior::CreateBombExterior(D3DXMATRIX * pBombMtx)
{
	//メモリ確保
	U_ptr<CBomb_Exterior> pPtr = std::make_unique<CBomb_Exterior>();

	//nullcheck
	if (pPtr)
	{
		//バッテリー生成
		pPtr->m_pBatteryList.emplace_back(CSceneX::CreateShared(D3DXVECTOR3(EXTERIOR_OFFSET.x, EXTERIOR_OFFSET.y, EXTERIOR_OFFSET.z), ZeroVector3,
																pBombMtx, CScene::OBJTYPE_BOMB_EXTERIOR, CModelInfo::MODEL_MODULE_NONE));

		//return
		return std::move(pPtr);
	}

	//return
	return nullptr;
}
