//-----------------------------------------------------------------------------
//
// ゲームオブジェクトクラス [GameObject.h]
// ゲーム上に存在するオブジェクトは全て継承する
// Player,Enemy,Bullet,Object etc..
// 自分のタグと当たり判定のポインタを持つ
// Author : Yoshiki Hosoya
//
//-----------------------------------------------------------------------------
#ifndef _GAMEOBJECT_H_
#define _GAMEOBJECT_H_

//-----------------------------------------------------------------------------
// インクルードファイル
//-----------------------------------------------------------------------------
#include "main.h"

//-----------------------------------------------------------------------------
// マクロ
//-----------------------------------------------------------------------------

//------------------------------------------------------------------------------
//クラス定義
//------------------------------------------------------------------------------
class CCollision;

class CGameObject
{
public:
	void	SetTag(TAG Tag) { m_Tag = Tag; };	// タグの設定
	TAG		GetTag() { return m_Tag; };	// タグの取得

private:
	TAG		m_Tag;								// タグ
	std::unique_ptr<CCollision>		m_pCollision;
};

#endif