//------------------------------------------------------------------------------
//
//モジュールのパーツの基底クラス  [module_parts_base.cpp]
//Author:Yoshiki Hosoya
//
//------------------------------------------------------------------------------
#ifndef _MODULE_PARTS_BASE_H_
#define _MODULE_PARTS_BASE_H_
//------------------------------------------------------------------------------
//インクルード
//------------------------------------------------------------------------------
#include "main.h"

//------------------------------------------------------------------------------
//クラス定義
//------------------------------------------------------------------------------
class CModule_Parts_Base
{
public:
	CModule_Parts_Base()
	{
	};
	virtual ~CModule_Parts_Base() {};

	virtual HRESULT Init() = 0;					//初期化
	virtual void Uninit() = 0;					//終了
	virtual void Update() = 0;					//更新
	virtual void Draw() = 0;					//描画
	virtual void ShowDebugInfo() = 0;			//デバッグ情報表記
private:


};
#endif