//*************************************************************************************************************
//
// タブレット処理 [tablet.h]
// Author:IKUTO SEKINE
//
//*************************************************************************************************************
#ifndef _TABLET_H_
#define _TABLET_H_

//-------------------------------------------------------------------------------------------------------------
// インクルードファイル
//-------------------------------------------------------------------------------------------------------------
#include "sceneX.h"
#include "Mylibrary.h"

//-------------------------------------------------------------------------------------------------------------
// クラス定義
//-------------------------------------------------------------------------------------------------------------
class CTabletButton;
class CTablet : public CSceneX
{
public:
	CTablet();																	// コンストラクタ
	~CTablet();																	// デストラクタ

	HRESULT             Init();													// 初期化
	void                Update();												// 更新
	void                Draw();													// 描画
	inline void         ShowDebugInfo() {};										// デバッグ情報表記

	bool                ItIsPressingButtons(void);								// ボタンを押しているか

	// 生成
	static std::shared_ptr<CTablet> Create(CONST D3DXVECTOR3 &pos);					// 生成
private:
	MyVector<std::shared_ptr<CTabletButton>> m_Button;

};

#endif