// ===================================================================
//
// メイン処理 [ main.h ]
// Author : KANAN NAGANAWA
//
// ===================================================================
#ifndef _MAIN_H_
#define _MAIN_H_

#define _CRT_SECURE_NO_WARNINGS			// 警告除去
#define	DIRECTINPUT_VERSION (0x0800)	// ダイレクトインプットのVer
#define _WINSOCKAPI_					// winsock2の使用に必要

// ===================================================================
// インクルードファイル
// ===================================================================
#include <windows.h>
#include <winsock2.h>						// winsock2の仕様に必要
#include <time.h>							// 時間の取得に必要
#include <stdio.h>							// 一般的なヘッダーファイル
#include <stdlib.h>							// システム
#include <dinput.h>							// ダイレクトインプット
#include <iostream>							// コンソール出力に必要
#include <tchar.h>							// シングル・マルチバイトやUnicode文字列の切り替えを行う
#include <thread>							// マルチスレッド
#include <vector>							// vectorの使用に必要

// ===================================================================
// ライブラリのリンク
// ===================================================================
#pragma comment (lib, "dxguid.lib")		// DirectXコンポーネント(部品)使用に必要
#pragma comment (lib, "winmm.lib")		// システム時間取得に必要
#pragma comment (lib, "dinput8.lib")	// DirectInput入力処理に必要

// ===================================================================
// マクロ定義
// ===================================================================
#define MAX_PLAYER (2)

// ===================================================================
// クラス定義
// ===================================================================

// ===================================================================
// 構造体定義
// ===================================================================

// ===================================================================
// プロトタイプ関数宣言
// ===================================================================

#endif